VladimirAstrelin/CALCULATOR-C-STM32/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : CALC v2.0
  ******************************************************************************
  * @attention
  * Copyright (c) 18-09-2025 Vlad Astrelin
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BTN_Pin GPIO_PIN_0
#define USER_BTN_GPIO_Port GPIOA
#define GREEN_Pin GPIO_PIN_12
#define GREEN_GPIO_Port GPIOD
#define ORANGE_Pin GPIO_PIN_13
#define ORANGE_GPIO_Port GPIOD
#define RED_Pin GPIO_PIN_14
#define RED_GPIO_Port GPIOD
#define BLUE_Pin GPIO_PIN_15
#define BLUE_GPIO_Port GPIOD
#define R0_Pin GPIO_PIN_6
#define R0_GPIO_Port GPIOC
#define R1_Pin GPIO_PIN_7
#define R1_GPIO_Port GPIOC
#define R2_Pin GPIO_PIN_8
#define R2_GPIO_Port GPIOC
#define R3_Pin GPIO_PIN_9
#define R3_GPIO_Port GPIOC
#define R4_Pin GPIO_PIN_8
#define R4_GPIO_Port GPIOA
#define R6_Pin GPIO_PIN_10
#define R6_GPIO_Port GPIOA
#define R7_Pin GPIO_PIN_15
#define R7_GPIO_Port GPIOA
#define R5_Pin GPIO_PIN_11
#define R5_GPIO_Port GPIOC
#define C0_Pin GPIO_PIN_0
#define C0_GPIO_Port GPIOD
#define C1_Pin GPIO_PIN_1
#define C1_GPIO_Port GPIOD
#define C2_Pin GPIO_PIN_2
#define C2_GPIO_Port GPIOD
#define C3_Pin GPIO_PIN_3
#define C3_GPIO_Port GPIOD
#define C4_Pin GPIO_PIN_4
#define C4_GPIO_Port GPIOD
#define C5_Pin GPIO_PIN_6
#define C5_GPIO_Port GPIOD
#define C6_Pin GPIO_PIN_7
#define C6_GPIO_Port GPIOD
#define C7_Pin GPIO_PIN_3
#define C7_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
